
from starlette.status import HTTP_405_METHOD_NOT_ALLOWED
from fastapi.responses import JSONResponse
from linebot import LineBotApi, WebhookHandler
from linebot.exceptions import LineBotApiError, InvalidSignatureError
from linebot.models import MessageEvent, TextMessage, TextSendMessage
import random
import nltk
from fastapi import FastAPI, Form
from pythainlp.tokenize import word_tokenize
from pythainlp.spell import NorvigSpellChecker
from transformers import TFT5ForConditionalGeneration, T5Tokenizer
from pythainlp.util import dict_trie
from pythainlp.corpus.common import thai_words
import pythainlp
from transformers import pipeline
from fastapi import FastAPI, Request, Response
from pythainlp.tokenize import word_tokenize
from pythainlp.corpus import thai_stopwords
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics.pairwise import cosine_similarity
import random
from pythainlp.tokenize import word_tokenize
import numpy as np
import thaispellcheck

mrcpipeline = pipeline("question-answering",
                       model="MyMild/finetune_iapp_thaiqa")
# Download necessary data
nltk.download('punkt')
nltk.download('stopwords')

# Setup for spell checker
custom_words = set(thai_words())
trie = dict_trie(dict_source=custom_words)
spell_checker = NorvigSpellChecker(custom_dict=trie)
app = FastAPI()
dataset = {
    "เกณฑ์การรับสมัคร": {
        "examples": ["เกณฑ์การรับสมัคร", "กำหนดการสมัคร", "กำหนดการสมัครเป็นอย่างไรบ้าง", 'กำหนดการสมัครคิดยังไงง'],
        "responses": ["เกณฑ์การรับสมัครประกอบด้วย GPA ขั้นต่ำ 3.0, การเสร็จสิ้นหลักสูตรพื้นฐาน, และการส่งคำชี้แจงส่วนบุคคล"]
    },
    "สาขา": {
        "examples": ["คณะนี้มีสาขาอะไรบ้าง", "คณะนี้มีกี่สาขา", "คณะนี้มีสาขาอะไรบ้าง", "เกณฑ์การรับสมัคร"],
        "responses": ["วิทยาการคอมพิวเตอร์ (Computer Science: CS), เป็นศาสตร์เกี่ยวกับการศึกษาค้นคว้าทฤษฏีการคำนวณสำหรับคอมพิวเตอร์, และทฤษฏีการประมวลผลสารสนเทศ, ทั้งด้านซอฟต์แวร์, ฮาร์ดแวร์, และเครือข่าย, ประกอบด้วยหลายหัวข้อที่เกี่ยวข้อง, เช่น, การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี, ทฤษฎีภาษาโปรแกรม, ทฤษฏีการพัฒนาซอฟต์แวร์, ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์, และทฤษฏีเครือข่าย, เทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (Information Technology for Digital Industry : ITDI), เป็นศาสตร์เกี่ยวกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ, ซึ่งครอบคลุมถึงการรับ-ส่ง, การแปลง, การจัดเก็บ, การประมวลผล, และการค้นคืนสารสนเทศ, เป็นการประยุกต์ใช้ทฤษฎีและขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงาน, การศึกษาอุปกรณ์ต่างๆทางเทคโนโลยีสารสนเทศ, การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม, 	วิศวกรรมซอฟต์แวร์ (Software Engineering: SE), เป็นศาสตร์เกี่ยวกับวิศวกรรมด้านซอฟต์แวร์, เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรมในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมาย, ภายใต้เงื่อนไขที่กำหนด, โดยเริ่มตั้งแต่การเก็บความต้องการ, การตั้งเป้าหมายของระบบ, การออกแบบ, กระบวนการพัฒนา, การตรวจสอบ, การประเมินผล, การติดตามโครงการ, การประเมินต้นทุน, การรักษาความปลอดภัย, ไปจนถึงการคิดราคาซอฟต์แวร์, เป็นต้น, ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AAI), ได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์, ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล, และระบบอัจฉริยะ, เช่น, โรงงานอัจฉริยะ (Smart Factory), เกษตรอัจฉริยะ (Smart Agriculture), ฟาร์มอัจฉริยะ (Smart Farming), เมืองอัจฉริยะ (Smart City), การบริการอัจฉริยะ (Smart Services), การท่องเที่ยวอัจฉริยะ (Smart Tourisms), และโลจิสติกส์อัจฉริยะ (Smart Logistrics), สอดคล้องกับโครงการเขตพัฒนาพิเศษภาคตะวันออก (EEC) ภายใต้แผนยุทธศาสตร์ประเทศไทย 4.0"]
    },
    "กำหนดการสมัคร": {
        "examples": ["กำหนดการสมัครวันไหน", "สมัครเข้าเรียนได้ตอนไหน", "สามารถสมัครได้ตอนไหน"],
        "responses": ["กำหนดการสมัครสำหรับฤดูใบไม้ร่วง 2022 คือ 30 มิถุนายน 2022"]
    },
    "ค่าเรียน": {
        "examples": ["สาขา ITค่าทอมเท่าไหร่", "เทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัลค่าเทอมเท่าไหร่", "ค่าใช้จ่ายตลอดหลักสูตร", "เทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล(ITDI)", "ค่าเทอมเท่าไหร่", "ITDIค่าทอมเท่าไหร่", "ITค่าทอมเท่าไหร่", "ค่าเรียนเท่าไหร่", "ค่าเรียนเท่าไหร่บ้าง", "ค่าเรียนเท่าไหร่ครับ", "ค่าเรียนเท่าไหร่คะ"],
        "responses": ["ค่าใช้จ่ายตลอดหลักสูตรโดยประมาณ 184,000บาท (ภาคการศึกษาละ 23,000 บาท) ค่ะ"]
    },
    "สอบเข้า": {
        "examples": ["สอบเข้าเมื่อไหร่", "สอบเข้าวันไหน", "สอบเข้าเมื่อไหร่ครับ", "สอบเข้าเมื่อไหร่คะ", "สอบเข้าวันไหนคะ", "สอบเข้าวันไหนครับ"],
        "responses": ["สอบเข้าวันที่ 9 ก.ย. 2022"]
    },
    "สมัครเรียน": {
        "examples": ["สมัครเรียนได้ที่ไหน", "สมัครเรียนอย่างไร", "สมัครเรียนที่ไหน"],
        "responses": ["สามารถสมัครเรียนได้ที่ https://reg.buu.ac.th/registrar/home.asp/"]
    },
    "สภาพแวดล้อมและสังคม": {
        "examples": ["สภาพแวดล้อมและสังคม", "สภาพแวดล้อม", "สภาพสังคม", "สภาพแวดล้อมและสังคมเป็นอย่างไร", "สภาพแวดล้อมและสังคมเป็นอย่างไรบ้าง", "สังคมเป็นยังไง"],
        "responses": ["สังคมที่นี่ดีค่ะ , คนในคณะส่วนใหญ่, จะค่อนข้างช่วยเหลือกันและกัน, ทั้งเรื่องการเรียน, การใช้ชีวิต"]
    },
    "อุปกรณ์การเรียน": {
        "examples": ["อุปกรณ์การเรียน", "อุปกรณ์การเรียนมีอะไรบ้าง", "อุปกรณ์การเรียนมีอะไรบ้างคะ", "อุปกรณ์การเรียนมีอะไรบ้างครับ", "อุปกรณ์การเรียนมีอะไรบ้างครับ", "อุปกรณ์การเรียนมีอะไรบ้างคะ", "อุปกรณ์การเรียนไม่มีได้ไหม", "ไม่มีอุปกรณ์การเรียนยืมได้มั้ย", "อุปกรณ์มีไหม", "มีอุปกรณ์มั้ย"],
        "responses": ["อุปกรณ์การเรียนที่จำเป็นคือ คอมพิวเตอร์ โน๊ตบุ๊ค หรืออุปกรณ์ที่สามารถเข้าถึงอินเทอร์เน็ตได้ หากไม่มีทางคณะมีอุปกรณ์ให้ยืมกลับบ้านได้ค่ะ"]
    },
    "เรียนยากมั้ย": {
        "examples": ["การเรียน", "การเรียนเป็นยังไง", "การเรียนเป็นยังไงบ้าง", "การเรียนเป็นยังไงคะ", "การเรียนเป็นยังไงครับ", "การเรียนเป็นยังไงคะ", "การเรียนเป็นยังไงครับ", "การเรียนเป็นยังไงคะ", "เรียนยากมั้ย", "คณะนี้เรียนยากมั้ย"],
        "responses": ["การเรียนที่นี่ดีค่ะ มีอาจารย์ที่ชำนาญในสาขาวิชา และมีการสอนที่ดี มีการสนับสนุนในการเรียนอย่างดี มีการสนับสนุนในการเรียนอย่างดี", "เป็นคำถามที่น่าสนใจนะคะ , จะเรียกว่ายากก็อาจจะยาก, จะเรียกว่าง่ายก็อาจจะง่าย, อยู่ที่ความชอบและความถนัดของแต่ละคน, ถ้าเราชอบในด้านนี้และสนุกกับการเรียนรู้เกี่ยวกับสายไอที, ก็จะมองว่ามันง่ายและสนุกไปกับการเรียน, แต่สำหรับคนที่ไม่ชอบหรือสนใจแต่ไม่เก่งด้านนี้, ก็อาจจะยากแต่ไม่ยากเกินไปแน่นอนค่ะ"]
    },
    "SE": {
        "examples": ["SE", "SEคืออะไร", "SEคืออะไรคะ", "SEคืออะไรครับ", "SEคืออะไรคะ", "SEคืออะไรครับ", "SEคืออะไรคะ", "SEคืออะไรครับ", "SEคืออะไรคะ", "SEคืออะไรครับ", "สาขา SE", "SE"],
        "responses": ["วิศวกรรมซอฟต์แวร์ (Software Engineering: SE), เป็นศาสตร์เกี่ยวกับวิศวกรรมด้านซอฟต์แวร์, เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรมในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมาย, ภายใต้เงื่อนไขที่กำหนด, โดยเริ่มตั้งแต่การเก็บความต้อการ, การตั้งเป้าหมายของระบบ, การออกแบบ, กระบวนการพัฒนา, การตรวจสอบ, การประเมินผล, การติดตามโครงการ, การประเมินต้นทุน, การรักษาความปลอดภัย, ไปจนถึงการคิดราคาซอฟต์แวร์, เป็นต้น"]
    },
    "CS": {
        "examples": ["CS", "CSคืออะไร", "CSคืออะไรคะ", "CSคืออะไรครับ", "CSคืออะไรคะ", "CSคืออะไรครับ", "CSคืออะไรคะ", "CSคืออะไรครับ", "CSคืออะไรคะ", "CSคืออะไรครับ", "สาขา CS", "CS เรียนอะไรบ้าง", ""],
        "responses": ["วิทยาการคอมพิวเตอร์ (Computer Science: CS), เป็นศาสตร์เกี่ยวกับการศึกษาค้นคว้าทฤษฏีการคำนวณสำหรับคอมพิวเตอร์, และทฤษฏีการประมวลผลสารสนเทศ, ทั้งด้านซอฟต์แวร์, ฮาร์ดแวร์, และเครือข่าย, ประกอบด้วยหลายหัวข้อที่เกี่ยวข้อง, เช่น, การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี, ทฤษฏีภาษาโปรแกรม, ทฤษฏีการพัฒนาซอฟต์แวร์, ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์, และทฤษฏีเครือข่าย"]
    },
    "IT": {
        "examples": ["IT", "ITDI", "ITคืออะไร", "ITคืออะไรคะ", "ITคืออะไรครับ", "ITคืออะไรคะ", "ITคืออะไรครับ", "ITคืออะไรคะ", "ITคืออะไรครับ", "ITคืออะไรคะ", "ITคืออะไรครับ", "สาขา IT", "IT เรียนอะไรบ้าง"],
        "responses": ["เทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (Information Technology for Digital Industry : ITDI), เป็นศาสตร์เกี่ยวกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ, ซึ่งครอบคลุมถึงการรับ-ส่ง, การแปลง, การจัดเก็บ, การประมวลผล, และการค้นคืนสารสนเทศ, เป็นการประยุกต์ใช้ทฤษฎีและขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงาน, การศึกษาอุปกรณ์ต่างๆทางเทคโนโลยีสารสนเทศ, การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม"]

    },
    "AAI": {
        "examples": ["AAI", "AAIคืออะไร", "AAIคืออะไรคะ", "AAIคืออะไรครับ", "AAIคืออะไรคะ", "AAIคืออะไรครับ", "AAIคืออะไรคะ", "AAIคืออะไรครับ", "AAIคืออะไรคะ", "AAIคืออะไรครับ", "สาขา AAI", "AAI เรียนอะไรบ้าง", "AI"],
        "responses": ["ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AAI), ได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์, ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล, และระบบอัจฉริยะ, เช่น, โรงงานอัจฉริยะ (Smart Factory), เกษตรอัจฉริยะ (Smart Agriculture), ฟาร์มอัจฉริยะ (Smart Farming), เมืองอัจฉริยะ (Smart City), การบริการอัจฉริยะ (Smart Services), การท่องเที่ยวอัจฉริยะ (Smart Tourisms), และโลจิสติกส์อัจฉริยะ (Smart Logistrics), สอดคล้องกับโครงการเขตพัฒนาพิเศษภาคตะวันออก (EEC) ภายใต้แผนยุทธศาสตร์ประเทศไทย 4.0"]
    },
    "เรียนต่อ": {
        "examples": ["เรียนต่อ", "เรียนต่อยังไง", "เรียนต่อยังไงบ้าง", "เรียนต่อยังไงคะ", "เรียนต่อยังไงครับ", "เรียนต่อยังไงคะ", "เรียนต่อยังไงครับ", "เรียนต่อยังไงคะ", "เรียนต่อยังไงครับ", "เรียนต่อยังไงคะ", "เรียนต่อยังไงครับ"],
        "responses": ["เรียนต่อที่นี่ดีค่ะ มีความร่วมมือในการเรียนรู้ มีอาจารย์ที่ชำนาญในสาขาวิชา และมีการสนับสนุนในการเรียนอย่างดี มีการสนับสนุนในการเรียนอย่างดี ในระดับปริญญาเอก  , ทางคณะวิทยาการสารสนเทศ  , มหาวิทยาลัยบูรพา  , เปิดสอนหลักสูตร , ปรัชญาดุษฎีบัณฑิต  , สาขาวิชาวิทยาการข้อมู"]
    },
    "เรียนต่อที่ไหน": {
        "examples": ["เรียนต่อที่ไหน", "เรียนต่อที่ไหนดี", "เรียนต่อที่ไหนดีคะ", "เรียนต่อที่ไหนดีครับ", "เรียนต่อที่ไหนดีคะ", "เรียนต่อที่ไหนดีครับ", "เรียนต่อที่ไหนดีคะ", "เรียนต่อที่ไหนดีครับ", "เรียนต่อที่ไหนดีคะ", "เรียนต่อที่ไหนดีครับ"],
        "responses": ["เรียนต่อที่นี่ดีค่ะ มีความร่วมมือในการเรียนรู้ มีอาจารย์ที่ชำนาญในสาขาวิชา และมีการสนับสนุนในการเรียนอย่างดี มีการสนับสนุนในการเรียนอย่างดี ในระดับปริญญาเอก  , ทางคณะวิทยาการสารสนเทศ  , มหาวิทยาลัยบูรพา  , เปิดสอนหลักสูตร , ปรัชญาดุษฎีบัณฑิต  , สาขาวิชาวิทยาการข้อมูล"]
    },
    "อาจารย์แพร": {
        "examples": ["รู้จักอาจารย์แพรมั้ย", "อาจารย์แพร", "อาจารย์แพรเป็นยังไง", "อาจารย์แพรเป็นยังไงบ้าง", "อาจารย์แพรเป็นยังไงคะ", "อาจารย์แพรเป็นยังไงครับ", "อาจารย์แพรเป็นยังไงคะ", "อาจารย์แพรเป็นยังไงครับ", "อาจารย์แพรเป็นยังไงคะ", "อาจารย์แพรเป็นยังไงครับ", "อาจารย์แพรเป็นยังไงคะ", "อาจารย์แพรเป็นยังไงครับ"],
        "responses": ["Master of NLP!!!!"]
    },
    "อาจรย์กบ": {
        "examples": ["รู้จักอาจารย์กบมั้ย", "อาจารย์กบ", "อาจารย์กบเป็นยังไง", "อาจารย์กบเป็นยังไงบ้าง", "อาจารย์กบเป็นยังไงคะ", "อาจารย์กบเป็นยังไงครับ", "อาจารย์กบเป็นยังไงคะ", "อาจารย์กบเป็นยังไงครับ", "อาจารย์กบเป็นยังไงคะ", "อาจารย์กบเป็นยังไงครับ", "อาจารย์กบเป็นยังไงคะ", "อาจารย์กบเป็นยังไงครับ"],
        "responses": ["อาจารย์กบอ๊บ อ๊บ"]
    },
    
    "ความแตกต่างระหว่างสาขา": {
        "examples": ["ความแตกต่างระหว่างสาขา", "ความแตกต่างระหว่างสาขาเป็นยังไง", "ความแตกต่างระหว่างสาขาเป็นยังไงบ้าง", "ความแตกต่างระหว่างสาขาเป็นยังไงคะ", "ความแตกต่างระหว่างสาขาเป็นยังไงครับ", "ความแตกต่างระหว่างสาขาเป็นยังไงคะ", "ความแตกต่างระหว่างสาขาเป็นยังไงครับ", "ความแตกต่างระหว่างสาขาเป็นยังไงคะ", "ความแตกต่างระหว่างสาขาเป็นยังไงครับ", "ความแตกต่างระหว่างสาขาเป็นยังไงคะ", "ความแตกต่างระหว่างสาขาเป็นยังไงครับ"],
        "responses": ["ความแตกต่างระหว่างสาขา คือ วิทยาการคอมพิวเตอร์ (Computer Science: CS), เป็นศาสตร์เกี่ยวกับการศึกษาค้นคว้าทฤษฏีการคำนวณสำหรับคอมพิวเตอร์, และทฤษฏีการประมวลผลสารสนเทศ, ทั้งด้านซอฟต์แวร์, ฮาร์ดแวร์, และเครือข่าย, ประกอบด้วยหลายหัวข้อที่เกี่ยวข้อง, เช่น, การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี, ทฤษฏีภาษาโปรแกรม, ทฤษฏีการพัฒนาซอฟต์แวร์, ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์, และทฤษฏีเครือข่าย, เทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (Information Technology for Digital Industry : ITDI), เป็นศาสตร์เกี่ยวกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ, ซึ่งครอบคลุมถึงการรับ-ส่ง, การแปลง, การจัดเก็บ, การประมวลผล, และการค้นคืนสารสนเทศ, เป็นการประยุกต์ใช้ทฤษฎีแะขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงาน, การศึกษาอุปกรณ์ต่างๆทางเทคโนโลยีสารสนเทศ, การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม ในสาขา SE  , จะเป็นการเรียน , ที่เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรม , ในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมาย , ภายใต้เงื่อนไขที่กำหนด , โดยเริ่มตั้งแต่การเก็บความต้องการ, การตั้งเป้าหมายของระบบ , การออกแบบ  ,  กระบวนการพัฒนา , การตรวจสอบ , การประเมินผล , การติดตามโครงการ , การประเมินต้นทุน  , การรักษาความปลอดภัย ,  ไปจนถึงการคิดราคาซอฟต์แวร์ จะเป็นการเรียน , ที่เกี่ยวข้องกับปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ  , ได้พัฒนาขึ้นเพื่อตอบสนอง , ต่อความต้องการบุคลากร  , ด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะ , ที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business)  , บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์  , ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล , และระบบอัจฉริยะ  , เช่น  , โรงงานอัจฉริยะ (Smart Factory) , เกษตรอัจฉริยะ (Smart Agriculture)  , ฟาร์มอัจฉริยะ (Smart Farming)  , มืองอัจฉริยะ (Smart City)"]

    },
    "ฝึกงาน": {
        "examples": ["ฝึกงาน", "ฝึกงานยังไง", "มีฝึกงานมั้ย", "ระยะเวลาการฝึกงาน", "ช่วงการฝึกงาน"],
        "responses": ["สามารถฝึกงานได้ที่บริษัทต่างๆ ที่เกี่ยวข้องกับสาขาวิชาที่เรียนอยู่ ค่ะ"]
    },
}
rule_based_responses = {

    "สวัสดี": "สวัสดีครับ มีอะไรให้เราช่วยเหลือคุณได้บ้างไหมครับ?",
    "สวัสดีครับ": "สวัสดีค่ะ! มีคำถามหรือเรื่องใดที่คุณต้องการสอบถามหรือพูดคุยเกี่ยวกับบริการของเราสามารถสอบถามได้เลยน่ะค่ะ?",
    "สวัสดีค่ะ": "สวัสดีครับ! มีคำถามหรือเรื่องใดที่คุณต้องการสอบถามหรือพูดคุยเกี่ยวกับบริการของเราส่ามารถสอบถามได้เลยน่ะครับ?",

    "ลาก่อน": "ขอบคุณสำหรับการสนทนา! หากมีคำถามหรือความต้องการใดๆ เพิ่มเติม โปรดอย่าลังเลที่จะติดต่อเราอีกครั้ง ขอให้มีวันที่ดีค่ะ!",

    "เกณฑ์การรับสมัคร": "เป็นผู้สำเร็จการศึกษา  ม.6  มีผลการเรียนเฉลี่ย(GPA)ไม่ต่ำกว่า  2.50 และสามารถปฏิบัติงานสหกิจศึกษา ณ สถานที่ประกอบการได้ค่ะ",
    "กำหนดการสมัคร": "จะมีรอบการรับสมัคร TCAS 4 รอบ โดย รอบที่ 1 Portfolio เริ่มรับสมัคร  25 ต.ค. 2566 - 27 พ.ย. 2566, รอบที่ 2 Quota เริ่มรับสมัคร  13 ก.พ. 2567 - 16 เม.ย. 2567, รอบที่ 3 Admission เริ่มรับสมัคร  28 พ.ค. 2567 - 11 มิ.ย. 2567, รอบที่ 4 Direct Admission เริ่มรับสมัคร  13 ก.พ. 2567 - 16 เม.ย. 2567 ค่ะ",
    "กิจกรรมคณะมีอะไรบ้าง": "มีเป็นช่วงๆค่ะ กิจกรรมจะมีเยอะในช่วงปี 1 ซึ่งส่วนใหญ่จะเป็นกิจกรรมของมหาลัยค่ะ",

    "สาขา IT คืออะไร": "หลักสูตรวิทยาศาสตร์บัญฑิต สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (Information Technology for Digital Industry: IT for Digital Industry) หรือ (ITDI) เป็นหลักสูตรที่ผลิตบัณฑิตที่มีความเชี่ยวชาญทางด้านเทคโนโลยีสารสนเทศและสื่อมัลติมีเดียเชิงปฏิสัมพันธ์ ควบคู่กับทักษะที่จำเป็นสำหรับศตวรรษที่ 21 และทักษะการใช้ภาษาอังกฤษที่จำเป็นในการประกอบวิชาชีพและศึกษาหาความรู้ใหม่เพิ่มเติมเพื่อเป็นกำลังหลักในการพัฒนาและสร้างขีดความสามารถทางการแข่งขันของประเทศตามนโยบายประเทศไทย 4.0 เพื่อตอบสนองต่อความต้องการบุคลากรทางด้านคอมพิวเตอร์และเทคโนโลยีสารสนเทศเป็นจำนวนมากของประเทศ และรองรับการพัฒนาบุคลากรโดยเฉพาะในเขตพื้นที่ EEC และสากลค่ะ",
    "สาขา CS คืออะไร": "หลักสูตรวิทยาศาสตร์บัญฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้พัฒนาขึ้นเพื่อตอบสนองความต้องการด้านซอฟต์แวร์อัจฉริยะ เพื่อเปลี่ยนรูปองค์กรอุตสาหกรรมไปสู่องค์กรอุตสาหกรรมอัจฉริยะบนพื้นฐานของวิทยาการคอมพิวเตอร์ตลอดถึงการพัฒนากำลังคนตามความต้องการของโครงการพัฒนาระเบียงเศรษฐกิจภาคตะวันออก (EEC) ได้แก่ กลุ่มการท่องเที่ยวรายได้ดีและการท่องเที่ยวเชิงสุขภาพ กลุ่มดิจิทัล กลุ่มการแพทย์ครบวงจร กลุ่มยานยนต์แห่งอนาคต กลุ่มโลจิสติกส์ กลุ่มหุ่นยนต์ กลุ่มอิเล็กทรอนิกส์อัจฉริยะ กลุ่มการพาณิชยนาวี กลุ่มการขนส่งระบบราง และกลุ่มการบินอากาศยานค่ะ",
    "สาขา SE คืออะไร": "หลักสูตรวิทยาศาสตร์บัญฑิต สาขาวิชาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เป็นศาสตร์เกี่ยวกับการใช้กระบวนการทางวิศวกรรมในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมายภายใต้เงื่อนไขที่กำหนดโดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ การพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ค่ะ",
    "สาขา AAI คืออะไร": "หลักสูตรวิทยาศาสตร์บัญฑิต สาขาวิชาปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Samrt Technology: AII) มุ่งเน้นวางรากฐานองค์ความรู้ทางด้านปัญญาประดิษฐ์และเทคโนโลยีอจฉริยะ ผ่านการเรียนรู้ในรูปแบบฝึกปฏิบัติจริง และบูรณาการเรียนรู้ร่วมกับการทำงาน มุ่งสร้างนวัตกรรมและสิ่งประดิษฐ์ให้สอดคล้องกับการเปลี่ยนแปลงของวิทยาการในปัจจุบัน อย่างมีจริยธรรม และสำนึกผิดชอบต่อสังคมค่ะ",

    "ค่าเทอมเท่าไหร่": "ประมาณการค่าใช้จ่าย การเก็บเงินค่าบำรุงรักษาธรรมเนียม การศึกษาแบบเหมาจ่ายภาคการศึกษาละ 23,000 บาทค่ะ",
    "ค่าเทอม":  "ค่าใช้จ่ายตลอดหลักสูตรโดยประมาณ 184,000บาท (ภาคการศึกษาละ 23,000 บาท) ค่ะ",
    "วิธีการสมัคร": "น้อง ๆ สามารถค้นหาข้อมูลหลักสูตร จำนวนรับ และเกณฑ์การคัดเลือก ที่เปิดรับในรอบ 1 - 3 ได้แล้วที่ mytcas.com พิมพ์ชื่อหลักสูตร คณะ และ/หรือ มหาวิทยาลัย ในช่อง “ค้นหาข้อมูลหลักสูตรที่ต้องการศึกษา” ได้เลยค่ะ",
    "ค่าใช้จ่ายตลอดหลักสูตร": "ค่าใช้จ่ายตลอดหลักสูตรโดยประมาณ 184,000 บาท (ภาคการศึกษาละ 23,000 บาท) ค่ะ",

    "คณะวิทยาการสารสนเทศสังคมเป็นยังไงบ้าง": "สังคมที่นี่ดีค่ะคนในคณะส่วนใหญ่จะค่อนข้างช่วยเหลือกันและกันทั้งเรื่องการเรียนการใช้ชีวิต มีทั้งรุ่นพี่และอาจารย์ที่คอยข่วยเหลือเราอยู่ตลอดค่ะ",
    "สภาพแวดล้อมเป็นยังไง": "สังคมที่นี่ดีค่ะคนในคณะส่วนใหญ่จะค่อนข้างช่วยเหลือกันและกันทั้งเรื่องการเรียนการใช้ชีวิต มีทั้งรุ่นพี่และอาจารย์ที่คอยข่วยเหลือเราอยู่ตลอดค่ะ",
    "สังคมเป็นยังไง": "สังคมที่นี่ดีค่ะคนในคณะส่วนใหญ่จะค่อนข้างช่วยเหลือกันและกันทั้งเรื่องการเรียนการใช้ชีวิต มีทั้งรุ่นพี่และอาจารย์ที่คอยข่วยเหลือเราอยู่ตลอดค่ะ",
    "สภาพแวดล้อม": "สังคมที่นี่ดีค่ะคนในคณะส่วนใหญ่จะค่อนข้างช่วยเหลือกันและกันทั้งเรื่องการเรียนการใช้ชีวิต มีทั้งรุ่นพี่และอาจารย์ที่คอยข่วยเหลือเราอยู่ตลอดค่ะ",

    "คณะวิทยาการสารสนเทศมีอุปกรณ์ครบไหม": "เรามีอุปกรณ์ที่จำเป็นสำหรับการเรียนการสอนและการฝึกปฏิบัติอย่างครบถ้วนค่ะ ท่านสามารถติดต่อฝ่ายบริการหรือรายละเอียดเพิ่มเติมเกี่ยวกับอุปกรณ์ได้ที่เคาน์เตอร์บริการของคณะเราได้เลยค่ะ",
    "อุปกรณ์มีไหม": "เรียนได้ค่ะที่คณะส่วนใหญ่จะเรียนด้วยเครื่องคอมพิวเตอร์ของทางคณะ และถ้านิสิตอยากศึกษาเพิ่มเติมที่บ้านแต่อุปกรณ์ไม่พร้อมทางคณะมีอุปกรณ์ให้นิสิตสามารถยืมกลับบ้านได้ค่ะ",
    "อุปกรณ์การเรียนไม่มีได้ไหม": "เรียนได้ค่ะที่คณะส่วนใหญ่จะเรียนด้วยเครื่องคอมพิวเตอร์ของทางคณะ และถ้านิสิตอยากศึกษาเพิ่มเติมที่บ้านแต่อุปกรณ์ไม่พร้อมทางคณะมีอุปกรณ์ให้นิสิตสามารถยืมกลับบ้านได้ค่ะ",
    "ไม่มีอุปกรณ์เรียนได้มั้ย": "เรียนได้ค่ะที่คณะส่วนใหญ่จะเรียนด้วยเครื่องคอมพิวเตอร์ของทางคณะ และถ้านิสิตอยากศึกษาเพิ่มเติมที่บ้านแต่อุปกรณ์ไม่พร้อมทางคณะมีอุปกรณ์ให้นิสิตสามารถยืมกลับบ้านได้ค่ะ",
    "ไม่มีอุปกรณ์การเรียนยืมได้มั้ย": "เรียนได้ค่ะที่คณะส่วนใหญ่จะเรียนด้วยเครื่องคอมพิวเตอร์ของทางคณะ และถ้านิสิตอยากศึกษาเพิ่มเติมที่บ้านแต่อุปกรณ์ไม่พร้อมทางคณะมีอุปกรณ์ให้นิสิตสามารถยืมกลับบ้านได้ค่ะ",

    "เรียนยากมั้ย": "คณะเรามีการสนับสนุนและทีมงานที่พร้อมช่วยเหลือในการเรียนและให้คำแนะนำตลอดระยะเวลาการศึกษาของนักศึกษาค่ะ",

    "คณะวิทยาการสารสนเทศมีสวัสดีการอะไรบ้าง":  "สวัสดีค่ะ! ในคณะวิทยาการสารสนเทศ เรามีการสนับสนุนและบริการต่างๆ ที่ช่วยให้นักศึกษาได้รับประสบการณ์การเรียนรู้ที่ดีที่สุด ซึ่งรวมถึงการเข้าถึงห้องสมุดและฐานข้อมูลทางวิชาการออนไลน์ โครงการสหกิจศึกษา การแข่งขันและกิจกรรมทางวิชาการต่างๆ เพื่อส่งเสริมทักษะและประสบการณ์ในการทำงานจริง และอื่นๆ อีกมากมายค่ะ",
    "สวัสดิการมีอะไรบ้าง": "สวัสดีค่ะ! ในคณะวิทยาการสารสนเทศ เรามีการสนับสนุนและบริการต่างๆ ที่ช่วยให้นักศึกษาได้รับประสบการณ์การเรียนรู้ที่ดีที่สุด ซึ่งรวมถึงการเข้าถึงห้องสมุดและฐานข้อมูลทางวิชาการออนไลน์ โครงการสหกิจศึกษา การแข่งขันและกิจกรรมทางวิชาการต่างๆ เพื่อส่งเสริมทักษะและประสบการณ์ในการทำงานจริง และอื่นๆ อีกมากมายค่ะ",
    "คณะวิทยาการสารสนเทศมีงานทำไหม": "ในคณะวิทยาการสารสนเทศ เรามีโอกาสที่จะเข้าร่วมกิจกรรมทางวิชาการและกิจกรรมนอกหลักสูตรมากมายที่ช่วยสร้างโอกาสในการฝึกประสบการณ์และพัฒนาทักษะต่างๆ นอกจากนี้ยังมีโอกาสทำงานร่วมกับสถานประกอบการผ่านโครงการสหกิจศึกษา ซึ่งเป็นโอกาสที่ดีในการเรียนรู้และเตรียมความพร้อมสำหรับการเข้าสู่ตลาดแรงงานในอนาคตค่ะ",

    "คณะนี้จบไปทำงานอะไร": "มีแน่นอนค่ะ สายงานด้านไอทียังมีความต้องการในตลาดสูง หลายๆบริษัทต้องการคนรุ่นใหม่มาทำงานเป็นจำนวนมากค่ะ",
    "เรียนจบไปมีงานทำมั้ย": "มีแน่นอนค่ะ สายงานด้านไอทียังมีความต้องการในตลาดสูง หลายๆบริษัทต้องการคนรุ่นใหม่มาทำงานเป็นจำนวนมากค่ะ",
    "มีงานทำเยอะมั้ย ตลาดแรงงานเป็นยังไงบ้าง": "มีแน่นอนค่ะ สายงานด้านไอทียังมีความต้องการในตลาดสูง หลายๆบริษัทต้องการคนรุ่นใหม่มาทำงานเป็นจำนวนมากค่ะ",
    "สายงานเป็นยังไงบ้าง": "มีแน่นอนค่ะ สายงานด้านไอทียังมีความต้องการในตลาดสูง หลายๆบริษัทต้องการคนรุ่นใหม่มาทำงานเป็นจำนวนมากค่ะ",

    "คณะวิทยาการสารสนเทศเรียนยากมั้ย": "เป็นคำถามที่น่าสนใจนะคะ ถ้าเราชอบในด้านนี้และสนุกกับการเรียนรู้เกี่ยวกับสายไอที ก็จะมองว่ามันง่ายและสนุกไปกับการเรียน แต่สำหรับคนที่ไม่ชอบหรือสนใจแต่ไม่เก่งด้านนี้ ก็อาจจะยากแต่ไม่ยากเกินไปแน่นอนค่ะ",
    "คณะนี้เรียนยากมั้ย": "เป็นคำถามที่น่าสนใจนะคะ ถ้าเราชอบในด้านนี้และสนุกกับการเรียนรู้เกี่ยวกับสายไอที ก็จะมองว่ามันง่ายและสนุกไปกับการเรียน แต่สำหรับคนที่ไม่ชอบหรือสนใจแต่ไม่เก่งด้านนี้ ก็อาจจะยากแต่ไม่ยากเกินไปแน่นอนค่ะ",
    "เรียนยากมั้ย": "เป็นคำถามที่น่าสนใจนะคะ ถ้าเราชอบในด้านนี้และสนุกกับการเรียนรู้เกี่ยวกับสายไอที ก็จะมองว่ามันง่ายและสนุกไปกับการเรียน แต่สำหรับคนที่ไม่ชอบหรือสนใจแต่ไม่เก่งด้านนี้ ก็อาจจะยากแต่ไม่ยากเกินไปแน่นอนค่ะ",
    "ความยากในการเรียนเป็นยังไง": "เป็นคำถามที่น่าสนใจนะคะ ถ้าเราชอบในด้านนี้และสนุกกับการเรียนรู้เกี่ยวกับสายไอที เราก็จะมองว่ามันง่ายและสนุกไปกับการเรียน แต่สำหรับคนที่ไม่ชอบหรือสนใจแต่ไม่เก่งด้านนี้ ก็อาจจะยากแต่ไม่ยากเกินไปแน่นอนค่ะ",

    "ความแตกต่างของวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล": "วิทยาการคอมพิวเตอร์ (Computer Science: CS) เป็นศาสตร์เกี่ยวกับการศึกษาค้นคว้าทฤษฏีการคำนวณสำหรับคอมพิวเตอร์ และทฤษฏีการประมวลผลสารสนเทศ ทั้งด้านซอฟต์แวร์ ฮาร์ดแวร์ และเครือข่าย ประกอบด้วยหลายหัวข้อที่เกี่ยวข้อง เช่น การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี ทฤษฎีภาษาโปรแกรม ทฤษฏีการพัฒนาซอฟต์แวร์ ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์ และทฤษฏีเครือข่าย เทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (Information Technology for Digital Industry : ITDI) เป็นศาสตร์เกี่ยวกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ ซึ่งครอบคลุมถึงการรับ-ส่ง การแปลง การจัดเก็บ การประมวลผล และการค้นคืนสารสนเทศ เป็นการประยุกต์ใช้ทฤษฎีและขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงาน การศึกษาอุปกรณ์ต่างๆทางเทคโนโลยีสารสนเทศ การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม วิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เป็นศาสตร์เกี่ยวกับวิศวกรรมด้านซอฟต์แวร์ เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรมในการดูแลการผลิตซอฟต ์แวร์ที่สามารถปฏิบัติงานตามเป้าหมาย ภายใต้เงื่อนไขที่กำหนด โดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ กระบวนการพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ เป็นต้น ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AAI) ได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์ ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล และระบบอัจฉริยะ เช่น โรงงานอัจฉริยะ (Smart Factory) เกษตรอัจฉริยะ (Smart Agriculture) ฟาร์มอัจฉริยะ (Smart Farming) เมืองอัจฉริยะ (Smart City) การบริการอัจฉริยะ (Smart Services) การท่องเที่ยวอัจฉริยะ (Smart Tourisms) และโลจิสติกส์อัจฉริยะ (Smart Logistrics) สอดคล้องกับโครงการเขตพัฒนาพิเศษภาคตะวันออก (EEC) ภายใต้แผนยุทธศาสตร์ประเทศไทย 4.0",

    "สาขา cs และ it": "วิทยาการคอมพิวเตอร์ (Computer Science: CS) เป็นศาสตร์เกี่ยวกับการศึกษาค้นคว้าทฤษฏีการคำนวณสำหรับคอมพิวเตอร์ และทฤษฏีการประมวลผลสารสนเทศ ทั้งด้านซอฟต์แวร์ ฮาร์ดแวร์ และเครือข่าย ประกอบด้วยหลายหัวข้อที่เกี่ยวข้อง เช่น การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี ทฤษฎีภาษาโปรแกรม ทฤษฏีการพัฒนาซอฟต์แวร์ ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์ และทฤษฏีเครือข่าย เทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (Information Technology for Digital Industry : ITDI) เป็นศาสตร์เกี่ยวกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ ซึ่งครอบคลุมถึงการรับ-ส่ง การแปลง การจัดเก็บ การประมวลผล และการค้นคืนสารสนเทศ เป็นการประยุกต์ใช้ทฤษฎีและขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงาน การศึกษาอุปกรณ์ต่างๆทางเทคโนโลยีสารสนเทศ การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม วิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เป็นศาสตร์เกี่ยวกับวิศวกรรมด้านซอฟต์แวร์, เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรมในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมาย ภายใต้เงื่อนไขที่กำหนด โดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ กระบวนการพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ เป็นต้น ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AAI) ได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์ ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล และระบบอัจฉริยะ เช่น โรงงานอัจฉริยะ (Smart Factory) เกษตรอัจฉริยะ (Smart Agriculture) ฟาร์มอัจฉริยะ (Smart Farming) เมืองอัจฉริยะ (Smart City) การบริการอัจฉริยะ (Smart Services) การท่องเที่ยวอัจฉริยะ (Smart Tourisms)  และโลจิสติกส์อัจฉริยะ (Smart Logistrics) สอดคล้องกับโครงการเขตพัฒนาพิเศษภาคตะวันออก (EEC) ภายใต้แผนยุทธศาสตร์ประเทศไทย 4.0",

    "สาขา SE": "หลังจากการสำเร็จการศึกษาในคณะวิทยาการสารสนเทศสาขาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เปิดโอกาสให้คุณเข้าสู่อาชีพหลากหลาย เช่น การเป็นวิศวกรรมซอฟต์แวร์ (Software Engineer) หรือนักเขียนโปรแกรม (Programmer/Developer) ที่สามารถพัฒนาและสร้างซอฟต์แวร์ได้ นอกจากนี้ยังมีสาขางานอื่นๆ เช่น วิศวกรความต้องการ (Requirement Engineer) ซึ่งเป็นผู้รับผิดชอบในการวิเคราะห์และเขียนความต้องการของซอฟต์แวร์ นักประกันคุณภาพซอฟต์แวร์ (Software Quality Assurance) ที่ให้ความสำคัญกับการตรวจสอบและคุณภาพของซอฟต์แวร์ เป็นต้น โดยคุณสามารถเลือกอาชีพที่เข้ากันได้กับความสนใจและความเชี่ยวชาญของคุณได้อย่างยืดหยุ่นค่ะ",
    "SE": "หลังจากการสำเร็จการศึกษาในคณะวิทยาการสารสนเทศสาขาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เปิดโอกาสให้คุณเข้าสู่อาชีพหลากหลาย เช่น การเป็นวิศวกรรมซอฟต์แวร์ (Software Engineer) หรือนักเขียนโปรแกรม (Programmer/Developer) ที่สามารถพัฒนาและสร้างซอฟต์แวร์ได้ นอกจากนี้ยังมีสาขางานอื่นๆ เช่น วิศวกรความต้องการ (Requirement Engineer) ซึ่งเป็นผู้รับผิดชอบในการวิเคราะห์และเขียนความต้องการของซอฟต์แวร์ นักประกันคุณภาพซอฟต์แวร์ (Software Quality Assurance) ที่ให้ความสำคัญกับการตรวจสอบและคุณภาพของซอฟต์แวร์ เป็นต้น โดยคุณสามารถเลือกอาชีพที่เข้ากันได้กับความสนใจและความเชี่ยวชาญของคุณได้อย่างยืดหยุ่นค่ะ",
    "SEจบไปทำอะไรได้บ้าง": "หลังจากการสำเร็จการศึกษาในคณะวิทยาการสารสนเทศสาขาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เปิดโอกาสให้คุณเข้าสู่อาชีพหลากหลาย เช่น การเป็นวิศวกรรมซอฟต์แวร์ (Software Engineer) หรือนักเขียนโปรแกรม (Programmer/Developer) ที่สามารถพัฒนาและสร้างซอฟต์แวร์ได้ นอกจากนี้ยังมีสาขางานอื่นๆ เช่น วิศวกรความต้องการ (Requirement Engineer) ซึ่งเป็นผู้รับผิดชอบในการวิเคราะห์และเขียนความต้องการของซอฟต์แวร์ นักประกันคุณภาพซอฟต์แวร์ (Software Quality Assurance) ที่ให้ความสำคัญกับการตรวจสอบและคุณภาพของซอฟต์แวร์ เป็นต้น โดยคุณสามารถเลือกอาชีพที่เข้ากันได้กับความสนใจและความเชี่ยวชาญของคุณได้อย่างยืดหยุ่นค่ะ",
    "สาขาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE)": "หลังจากการสำเร็จการศึกษาในคณะวิทยาการสารสนเทศสาขาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เปิดโอกาสให้คุณเข้าสู่อาชีพหลากหลาย เช่น การเป็นวิศวกรรมซอฟต์แวร์ (Software Engineer) หรือนักเขียนโปรแกรม (Programmer/Developer) ที่สามารถพัฒนาและสร้างซอฟต์แวร์ได้ นอกจากนี้ยังมีสาขางานอื่นๆ เช่น วิศวกรความต้องการ (Requirement Engineer) ซึ่งเป็นผู้รับผิดชอบในการวิเคราะห์และเขียนความต้องการของซอฟต์แวร์ นักประกันคุณภาพซอฟต์แวร์ (Software Quality Assurance) ที่ให้ความสำคัญกับการตรวจสอบและคุณภาพของซอฟต์แวร์ เป็นต้น โดยคุณสามารถเลือกอาชีพที่เข้ากันได้กับความสนใจและความเชี่ยวชาญของคุณได้อย่างยืดหยุ่นค่ะ",
    "เรียนจบทำอะไร": "หลังจากการสำเร็จการศึกษาในคณะวิทยาการสารสนเทศสาขาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เปิดโอกาสให้คุณเข้าสู่อาชีพหลากหลาย เช่น การเป็นวิศวกรรมซอฟต์แวร์ (Software Engineer) หรือนักเขียนโปรแกรม (Programmer/Developer) ที่สามารถพัฒนาและสร้างซอฟต์แวร์ได้ นอกจากนี้ยังมีสาขางานอื่นๆ เช่น วิศวกรความต้องการ (Requirement Engineer) ซึ่งเป็นผู้รับผิดชอบในการวิเคราะห์และเขียนความต้องการของซอฟต์แวร์ นักประกันคุณภาพซอฟต์แวร์ (Software Quality Assurance) ที่ให้ความสำคัญกับการตรวจสอบและคุณภาพของซอฟต์แวร์ เป็นต้น โดยคุณสามารถเลือกอาชีพที่เข้ากันได้กับความสนใจและความเชี่ยวชาญของคุณได้อย่างยืดหยุ่นค่ะ",
    "สายงาน SE": "หลังจากการสำเร็จการศึกษาในคณะวิทยาการสารสนเทศสาขาวิศวกรรมซอฟต์แวร์ (Software Engineering: SE) เปิดโอกาสให้คุณเข้าสู่อาชีพหลากหลาย เช่น การเป็นวิศวกรรมซอฟต์แวร์ (Software Engineer) หรือนักเขียนโปรแกรม (Programmer/Developer) ที่สามารถพัฒนาและสร้างซอฟต์แวร์ได้ นอกจากนี้ยังมีสาขางานอื่นๆ เช่น วิศวกรความต้องการ (Requirement Engineer) ซึ่งเป็นผู้รับผิดชอบในการวิเคราะห์และเขียนความต้องการของซอฟต์แวร์ นักประกันคุณภาพซอฟต์แวร์ (Software Quality Assurance) ที่ให้ความสำคัญกับการตรวจสอบและคุณภาพของซอฟต์แวร์ เป็นต้น โดยคุณสามารถเลือกอาชีพที่เข้ากันได้กับความสนใจและความเชี่ยวชาญของคุณได้อย่างยืดหยุ่นค่ะ",

    "สาขา CS": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้แก่ นักวิจัยด้านวิทยาการคอมพิวเตอร์และวิทยาศาสตร์เชิงคำนวณ นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่รับผิดชอบด้านเทคโนโลยีสารสนเทศและระบบคอมพิวเตอร์ ผู้เขียนชุดคำสั่ง (Programmer) ที่มีหน้าที่เขียนและพัฒนาซอฟต์แวร์ต่างๆ และผู้เขียนชุดคำสั่งบนโทรศัพท์มือถือ (Mobile Programmer IOS/Android) ที่พัฒนาแอปพลิเคชันบนโทรศัพท์มือถือ เพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งาน นักวิเคราะห์และออกแบบระบบ (System Analysis and Design) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบคอมพิวเตอร์ นักทดสอบโปรแกรมคอมพิวเตอร์ (Software Tester) ที่ทดสอบและตรวจสอบความถูกต้องและประสิทธิภาพของซอฟต์แวร์ นักออกแบบระบบฐานข้อมูล (Database Designer) ที่ออกแบบและจัดการฐานข้อมูล เพื่อให้มีความเรียบร้อยและมีประสิทธิภาพในการใช้งาน นักพัฒนาธุรกิจอัจฉริยะ (Business Intelligence Developer) ที่ใช้ข้อมูลทางธุรกิจในการวิเคราะห์และพัฒนาโซลูชันธุรกิจ และเจ้าหน้าที่ทำงานทางด้านการประยุกต์ใช้ปัญญาประดิษฐ์และข้อมูลดิจิทัลในองค์กร วิศวกรข้อมูล (Data Engineer) และนักวิเคราะห์ข้อมูล (Data Analysts) ที่ทำงานด้านการจัดการและวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในองค์กร ค่ะ",
    "CS": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้แก่ นักวิจัยด้านวิทยาการคอมพิวเตอร์และวิทยาศาสตร์เชิงคำนวณ นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่รับผิดชอบด้านเทคโนโลยีสารสนเทศและระบบคอมพิวเตอร์ ผู้เขียนชุดคำสั่ง (Programmer) ที่มีหน้าที่เขียนและพัฒนาซอฟต์แวร์ต่างๆ และผู้เขียนชุดคำสั่งบนโทรศัพท์มือถือ (Mobile Programmer IOS/Android) ที่พัฒนาแอปพลิเคชันบนโทรศัพท์มือถือ เพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งาน นักวิเคราะห์และออกแบบระบบ (System Analysis and Design) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบคอมพิวเตอร์ นักทดสอบโปรแกรมคอมพิวเตอร์ (Software Tester) ที่ทดสอบและตรวจสอบความถูกต้องและประสิทธิภาพของซอฟต์แวร์ นักออกแบบระบบฐานข้อมูล (Database Designer) ที่ออกแบบและจัดการฐานข้อมูล เพื่อให้มีความเรียบร้อยและมีประสิทธิภาพในการใช้งาน นักพัฒนาธุรกิจอัจฉริยะ (Business Intelligence Developer) ที่ใช้ข้อมูลทางธุรกิจในการวิเคราะห์และพัฒนาโซลูชันธุรกิจ และเจ้าหน้าที่ทำงานทางด้านการประยุกต์ใช้ปัญญาประดิษฐ์และข้อมูลดิจิทัลในองค์กร วิศวกรข้อมูล (Data Engineer) และนักวิเคราะห์ข้อมูล (Data Analysts) ที่ทำงานด้านการจัดการและวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในองค์กร ค่ะ",
    "CSจบไปทำอะไรได้บ้าง": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้แก่ นักวิจัยด้านวิทยาการคอมพิวเตอร์และวิทยาศาสตร์เชิงคำนวณ นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่รับผิดชอบด้านเทคโนโลยีสารสนเทศและระบบคอมพิวเตอร์ ผู้เขียนชุดคำสั่ง (Programmer) ที่มีหน้าที่เขียนและพัฒนาซอฟต์แวร์ต่างๆ และผู้เขียนชุดคำสั่งบนโทรศัพท์มือถือ (Mobile Programmer IOS/Android) ที่พัฒนาแอปพลิเคชันบนโทรศัพท์มือถือ เพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งาน นักวิเคราะห์และออกแบบระบบ (System Analysis and Design) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบคอมพิวเตอร์ นักทดสอบโปรแกรมคอมพิวเตอร์ (Software Tester) ที่ทดสอบและตรวจสอบความถูกต้องและประสิทธิภาพของซอฟต์แวร์ นักออกแบบระบบฐานข้อมูล (Database Designer) ที่ออกแบบและจัดการฐานข้อมูล เพื่อให้มีความเรียบร้อยและมีประสิทธิภาพในการใช้งาน นักพัฒนาธุรกิจอัจฉริยะ (Business Intelligence Developer) ที่ใช้ข้อมูลทางธุรกิจในการวิเคราะห์และพัฒนาโซลูชันธุรกิจ และเจ้าหน้าที่ทำงานทางด้านการประยุกต์ใช้ปัญญาประดิษฐ์และข้อมูลดิจิทัลในองค์กร วิศวกรข้อมูล (Data Engineer) และนักวิเคราะห์ข้อมูล (Data Analysts) ที่ทำงานด้านการจัดการและวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในองค์กร ค่ะ",
    "วิทยาการคอมพิวเตอร์ (Computer Science: CS)": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้แก่ นักวิจัยด้านวิทยาการคอมพิวเตอร์และวิทยาศาสตร์เชิงคำนวณ นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่รับผิดชอบด้านเทคโนโลยีสารสนเทศและระบบคอมพิวเตอร์ ผู้เขียนชุดคำสั่ง (Programmer) ที่มีหน้าที่เขียนและพัฒนาซอฟต์แวร์ต่างๆ และผู้เขียนชุดคำสั่งบนโทรศัพท์มือถือ (Mobile Programmer IOS/Android) ที่พัฒนาแอปพลิเคชันบนโทรศัพท์มือถือ เพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งาน นักวิเคราะห์และออกแบบระบบ (System Analysis and Design) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบคอมพิวเตอร์ นักทดสอบโปรแกรมคอมพิวเตอร์ (Software Tester) ที่ทดสอบและตรวจสอบความถูกต้องและประสิทธิภาพของซอฟต์แวร์ นักออกแบบระบบฐานข้อมูล (Database Designer) ที่ออกแบบและจัดการฐานข้อมูล เพื่อให้มีความเรียบร้อยและมีประสิทธิภาพในการใช้งาน นักพัฒนาธุรกิจอัจฉริยะ (Business Intelligence Developer) ที่ใช้ข้อมูลทางธุรกิจในการวิเคราะห์และพัฒนาโซลูชันธุรกิจ และเจ้าหน้าที่ทำงานทางด้านการประยุกต์ใช้ปัญญาประดิษฐ์และข้อมูลดิจิทัลในองค์กร วิศวกรข้อมูล (Data Engineer) และนักวิเคราะห์ข้อมูล (Data Analysts) ที่ทำงานด้านการจัดการและวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในองค์กร ค่ะ",
    "วิทยาการคอมพิวเตอร์": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้แก่ นักวิจัยด้านวิทยาการคอมพิวเตอร์และวิทยาศาสตร์เชิงคำนวณ นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่รับผิดชอบด้านเทคโนโลยีสารสนเทศและระบบคอมพิวเตอร์ ผู้เขียนชุดคำสั่ง (Programmer) ที่มีหน้าที่เขียนและพัฒนาซอฟต์แวร์ต่างๆ และผู้เขียนชุดคำสั่งบนโทรศัพท์มือถือ (Mobile Programmer IOS/Android) ที่พัฒนาแอปพลิเคชันบนโทรศัพท์มือถือ เพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งาน นักวิเคราะห์และออกแบบระบบ (System Analysis and Design) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบคอมพิวเตอร์ นักทดสอบโปรแกรมคอมพิวเตอร์ (Software Tester) ที่ทดสอบและตรวจสอบความถูกต้องและประสิทธิภาพของซอฟต์แวร์ นักออกแบบระบบฐานข้อมูล (Database Designer) ที่ออกแบบและจัดการฐานข้อมูล เพื่อให้มีความเรียบร้อยและมีประสิทธิภาพในการใช้งาน นักพัฒนาธุรกิจอัจฉริยะ (Business Intelligence Developer) ที่ใช้ข้อมูลทางธุรกิจในการวิเคราะห์และพัฒนาโซลูชันธุรกิจ และเจ้าหน้าที่ทำงานทางด้านการประยุกต์ใช้ปัญญาประดิษฐ์และข้อมูลดิจิทัลในองค์กร วิศวกรข้อมูล (Data Engineer) และนักวิเคราะห์ข้อมูล (Data Analysts) ที่ทำงานด้านการจัดการและวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในองค์กร ค่ะ",
    "เรียนจบทำอะไร": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้แก่ นักวิจัยด้านวิทยาการคอมพิวเตอร์และวิทยาศาสตร์เชิงคำนวณ นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่รับผิดชอบด้านเทคโนโลยีสารสนเทศและระบบคอมพิวเตอร์ ผู้เขียนชุดคำสั่ง (Programmer) ที่มีหน้าที่เขียนและพัฒนาซอฟต์แวร์ต่างๆ และผู้เขียนชุดคำสั่งบนโทรศัพท์มือถือ (Mobile Programmer IOS/Android) ที่พัฒนาแอปพลิเคชันบนโทรศัพท์มือถือ เพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งาน นักวิเคราะห์และออกแบบระบบ (System Analysis and Design) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบคอมพิวเตอร์ นักทดสอบโปรแกรมคอมพิวเตอร์ (Software Tester) ที่ทดสอบและตรวจสอบความถูกต้องและประสิทธิภาพของซอฟต์แวร์ นักออกแบบระบบฐานข้อมูล (Database Designer) ที่ออกแบบและจัดการฐานข้อมูล เพื่อให้มีความเรียบร้อยและมีประสิทธิภาพในการใช้งาน นักพัฒนาธุรกิจอัจฉริยะ (Business Intelligence Developer) ที่ใช้ข้อมูลทางธุรกิจในการวิเคราะห์และพัฒนาโซลูชันธุรกิจ และเจ้าหน้าที่ทำงานทางด้านการประยุกต์ใช้ปัญญาประดิษฐ์และข้อมูลดิจิทัลในองค์กร วิศวกรข้อมูล (Data Engineer) และนักวิเคราะห์ข้อมูล (Data Analysts) ที่ทำงานด้านการจัดการและวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในองค์กร ค่ะ",
    "สายงาน CS": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์ (Computer Science: CS) ได้แก่ นักวิจัยด้านวิทยาการคอมพิวเตอร์และวิทยาศาสตร์เชิงคำนวณ นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่รับผิดชอบด้านเทคโนโลยีสารสนเทศและระบบคอมพิวเตอร์ ผู้เขียนชุดคำสั่ง (Programmer) ที่มีหน้าที่เขียนและพัฒนาซอฟต์แวร์ต่างๆ และผู้เขียนชุดคำสั่งบนโทรศัพท์มือถือ (Mobile Programmer IOS/Android) ที่พัฒนาแอปพลิเคชันบนโทรศัพท์มือถือ เพื่อเพิ่มประสิทธิภาพและความสะดวกในการใช้งาน นักวิเคราะห์และออกแบบระบบ (System Analysis and Design) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบคอมพิวเตอร์ นักทดสอบโปรแกรมคอมพิวเตอร์ (Software Tester) ที่ทดสอบและตรวจสอบความถูกต้องและประสิทธิภาพของซอฟต์แวร์ นักออกแบบระบบฐานข้อมูล (Database Designer) ที่ออกแบบและจัดการฐานข้อมูล เพื่อให้มีความเรียบร้อยและมีประสิทธิภาพในการใช้งาน นักพัฒนาธุรกิจอัจฉริยะ (Business Intelligence Developer) ที่ใช้ข้อมูลทางธุรกิจในการวิเคราะห์และพัฒนาโซลูชันธุรกิจ และเจ้าหน้าที่ทำงานทางด้านการประยุกต์ใช้ปัญญาประดิษฐ์และข้อมูลดิจิทัลในองค์กร วิศวกรข้อมูล (Data Engineer) และนักวิเคราะห์ข้อมูล (Data Analysts) ที่ทำงานด้านการจัดการและวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในองค์กร ค่ะ",

    "สาขา ITDI": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (ITDI) ได้แก่ นักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบสารสนเทศเพื่อตอบสนองความต้องการขององค์กร นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่มีความเชี่ยวชาญในการดูแลระบบเทคโนโลยีสารสนเทศและสนับสนุนการทำงานขององค์กร ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย (System Administrator) ที่รับผิดชอบในการจัดการและดูแลระบบเครือข่ายคอมพิวเตอร์ขององค์กร นักออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศ (Web Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศต่างๆ นักออกแบบและพัฒนาซอฟต์แวร์ (Software Designer and Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาซอฟต์แวร์ต่างๆ เพื่อใช้ในงานอุตสาหกรรมดิจิทัล นักออกแบบและพัฒนาสื่อมัลติมีเดียเชิงโต้ตอบ (Interactive Media Creator) ที่มีความเชี่ยวชาญในการสร้างสื่อมัลติมีเดียที่มีการโต้ตอบกับผู้ใช้ นักออกแบบและพัฒนาส่วนติดต่อผู้ใช้งานเชิงโต้ตอบ (Interactive User Interface Designer) ที่รับผิดชอบในการออกแบบส่วนติดต่อผู้ใช้งานที่มีการโต้ตอบ นักออกแบบประสบการณ์ผู้ใช้งาน (User Experience Designer) ที่มีความเชี่ยวชาญในการออกแบบประสบการณ์การใช้งานที่ดีตามความต้องการของผู้ใช้ และผู้ประกอบการที่ใช้เทคโนโลยีดิจิทัลเป็นฐาน (Digital Technology Startup) ที่มุ่งเน้นใช้เทคโนโลยีดิจิทัลในการพัฒนาธุรกิจและสร้างสรรค์นวัตกรรมใหม่ๆ ในอุตสาหกรรมดิจิทัล ค่ะ",
    "ITDI": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (ITDI) ได้แก่ นักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบสารสนเทศเพื่อตอบสนองความต้องการขององค์กร นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่มีความเชี่ยวชาญในการดูแลระบบเทคโนโลยีสารสนเทศและสนับสนุนการทำงานขององค์กร ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย (System Administrator) ที่รับผิดชอบในการจัดการและดูแลระบบเครือข่ายคอมพิวเตอร์ขององค์กร นักออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศ (Web Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศต่างๆ นักออกแบบและพัฒนาซอฟต์แวร์ (Software Designer and Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาซอฟต์แวร์ต่างๆ เพื่อใช้ในงานอุตสาหกรรมดิจิทัล นักออกแบบและพัฒนาสื่อมัลติมีเดียเชิงโต้ตอบ (Interactive Media Creator) ที่มีความเชี่ยวชาญในการสร้างสื่อมัลติมีเดียที่มีการโต้ตอบกับผู้ใช้ นักออกแบบและพัฒนาส่วนติดต่อผู้ใช้งานเชิงโต้ตอบ (Interactive User Interface Designer) ที่รับผิดชอบในการออกแบบส่วนติดต่อผู้ใช้งานที่มีการโต้ตอบ นักออกแบบประสบการณ์ผู้ใช้งาน (User Experience Designer) ที่มีความเชี่ยวชาญในการออกแบบประสบการณ์การใช้งานที่ดีตามความต้องการของผู้ใช้ และผู้ประกอบการที่ใช้เทคโนโลยีดิจิทัลเป็นฐาน (Digital Technology Startup) ที่มุ่งเน้นใช้เทคโนโลยีดิจิทัลในการพัฒนาธุรกิจและสร้างสรรค์นวัตกรรมใหม่ๆ ในอุตสาหกรรมดิจิทัล ค่ะ",
    "ITDI จบไปทำอะไรได้บ้าง": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (ITDI) ได้แก่ นักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบสารสนเทศเพื่อตอบสนองความต้องการขององค์กร นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่มีความเชี่ยวชาญในการดูแลระบบเทคโนโลยีสารสนเทศและสนับสนุนการทำงานขององค์กร ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย (System Administrator) ที่รับผิดชอบในการจัดการและดูแลระบบเครือข่ายคอมพิวเตอร์ขององค์กร นักออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศ (Web Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศต่างๆ นักออกแบบและพัฒนาซอฟต์แวร์ (Software Designer and Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาซอฟต์แวร์ต่างๆ เพื่อใช้ในงานอุตสาหกรรมดิจิทัล นักออกแบบและพัฒนาสื่อมัลติมีเดียเชิงโต้ตอบ (Interactive Media Creator) ที่มีความเชี่ยวชาญในการสร้างสื่อมัลติมีเดียที่มีการโต้ตอบกับผู้ใช้ นักออกแบบและพัฒนาส่วนติดต่อผู้ใช้งานเชิงโต้ตอบ (Interactive User Interface Designer) ที่รับผิดชอบในการออกแบบส่วนติดต่อผู้ใช้งานที่มีการโต้ตอบ นักออกแบบประสบการณ์ผู้ใช้งาน (User Experience Designer) ที่มีความเชี่ยวชาญในการออกแบบประสบการณ์การใช้งานที่ดีตามความต้องการของผู้ใช้ และผู้ประกอบการที่ใช้เทคโนโลยีดิจิทัลเป็นฐาน (Digital Technology Startup) ที่มุ่งเน้นใช้เทคโนโลยีดิจิทัลในการพัฒนาธุรกิจและสร้างสรรค์นวัตกรรมใหม่ๆ ในอุตสาหกรรมดิจิทัล ค่ะ",
    "สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล(ITDI)": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (ITDI) ได้แก่ นักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบสารสนเทศเพื่อตอบสนองความต้องการขององค์กร นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่มีความเชี่ยวชาญในการดูแลระบบเทคโนโลยีสารสนเทศและสนับสนุนการทำงานขององค์กร ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย (System Administrator) ที่รับผิดชอบในการจัดการและดูแลระบบเครือข่ายคอมพิวเตอร์ขององค์กร นักออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศ (Web Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศต่างๆ นักออกแบบและพัฒนาซอฟต์แวร์ (Software Designer and Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาซอฟต์แวร์ต่างๆ เพื่อใช้ในงานอุตสาหกรรมดิจิทัล นักออกแบบและพัฒนาสื่อมัลติมีเดียเชิงโต้ตอบ (Interactive Media Creator) ที่มีความเชี่ยวชาญในการสร้างสื่อมัลติมีเดียที่มีการโต้ตอบกับผู้ใช้ นักออกแบบและพัฒนาส่วนติดต่อผู้ใช้งานเชิงโต้ตอบ (Interactive User Interface Designer) ที่รับผิดชอบในการออกแบบส่วนติดต่อผู้ใช้งานที่มีการโต้ตอบ นักออกแบบประสบการณ์ผู้ใช้งาน (User Experience Designer) ที่มีความเชี่ยวชาญในการออกแบบประสบการณ์การใช้งานที่ดีตามความต้องการของผู้ใช้ และผู้ประกอบการที่ใช้เทคโนโลยีดิจิทัลเป็นฐาน (Digital Technology Startup) ที่มุ่งเน้นใช้เทคโนโลยีดิจิทัลในการพัฒนาธุรกิจและสร้างสรรค์นวัตกรรมใหม่ๆ ในอุตสาหกรรมดิจิทัล ค่ะ",
    "สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (ITDI) ได้แก่ นักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบสารสนเทศเพื่อตอบสนองความต้องการขององค์กร นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่มีความเชี่ยวชาญในการดูแลระบบเทคโนโลยีสารสนเทศและสนับสนุนการทำงานขององค์กร ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย (System Administrator) ที่รับผิดชอบในการจัดการและดูแลระบบเครือข่ายคอมพิวเตอร์ขององค์กร นักออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศ (Web Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศต่างๆ นักออกแบบและพัฒนาซอฟต์แวร์ (Software Designer and Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาซอฟต์แวร์ต่างๆ เพื่อใช้ในงานอุตสาหกรรมดิจิทัล นักออกแบบและพัฒนาสื่อมัลติมีเดียเชิงโต้ตอบ (Interactive Media Creator) ที่มีความเชี่ยวชาญในการสร้างสื่อมัลติมีเดียที่มีการโต้ตอบกับผู้ใช้ นักออกแบบและพัฒนาส่วนติดต่อผู้ใช้งานเชิงโต้ตอบ (Interactive User Interface Designer) ที่รับผิดชอบในการออกแบบส่วนติดต่อผู้ใช้งานที่มีการโต้ตอบ นักออกแบบประสบการณ์ผู้ใช้งาน (User Experience Designer) ที่มีความเชี่ยวชาญในการออกแบบประสบการณ์การใช้งานที่ดีตามความต้องการของผู้ใช้ และผู้ประกอบการที่ใช้เทคโนโลยีดิจิทัลเป็นฐาน (Digital Technology Startup) ที่มุ่งเน้นใช้เทคโนโลยีดิจิทัลในการพัฒนาธุรกิจและสร้างสรรค์นวัตกรรมใหม่ๆ ในอุตสาหกรรมดิจิทัล ค่ะ",
    "เรียนจบทำอะไร": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (ITDI) ได้แก่ นักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบสารสนเทศเพื่อตอบสนองความต้องการขององค์กร นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่มีความเชี่ยวชาญในการดูแลระบบเทคโนโลยีสารสนเทศและสนับสนุนการทำงานขององค์กร ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย (System Administrator) ที่รับผิดชอบในการจัดการและดูแลระบบเครือข่ายคอมพิวเตอร์ขององค์กร นักออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศ (Web Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศต่างๆ นักออกแบบและพัฒนาซอฟต์แวร์ (Software Designer and Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาซอฟต์แวร์ต่างๆ เพื่อใช้ในงานอุตสาหกรรมดิจิทัล นักออกแบบและพัฒนาสื่อมัลติมีเดียเชิงโต้ตอบ (Interactive Media Creator) ที่มีความเชี่ยวชาญในการสร้างสื่อมัลติมีเดียที่มีการโต้ตอบกับผู้ใช้ นักออกแบบและพัฒนาส่วนติดต่อผู้ใช้งานเชิงโต้ตอบ (Interactive User Interface Designer) ที่รับผิดชอบในการออกแบบส่วนติดต่อผู้ใช้งานที่มีการโต้ตอบ นักออกแบบประสบการณ์ผู้ใช้งาน (User Experience Designer) ที่มีความเชี่ยวชาญในการออกแบบประสบการณ์การใช้งานที่ดีตามความต้องการของผู้ใช้ และผู้ประกอบการที่ใช้เทคโนโลยีดิจิทัลเป็นฐาน (Digital Technology Startup) ที่มุ่งเน้นใช้เทคโนโลยีดิจิทัลในการพัฒนาธุรกิจและสร้างสรรค์นวัตกรรมใหม่ๆ ในอุตสาหกรรมดิจิทัล ค่ะ",
    "สายงาน ITDI": "ตัวอย่างแนวทางในการประกอบอาชีพหลังจากสำเร็จการศึกษาในคณะวิทยาการสารสนเทศ สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล (ITDI) ได้แก่ นักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) ที่รับผิดชอบในการวิเคราะห์และออกแบบระบบสารสนเทศเพื่อตอบสนองความต้องการขององค์กร นักวิชาการคอมพิวเตอร์ (Computer Technical Officer) ที่มีความเชี่ยวชาญในการดูแลระบบเทคโนโลยีสารสนเทศและสนับสนุนการทำงานขององค์กร ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย (System Administrator) ที่รับผิดชอบในการจัดการและดูแลระบบเครือข่ายคอมพิวเตอร์ขององค์กร นักออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศ (Web Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาเว็บไซต์และระบบสารสนเทศต่างๆ นักออกแบบและพัฒนาซอฟต์แวร์ (Software Designer and Developer) ที่มีความเชี่ยวชาญในการออกแบบและพัฒนาซอฟต์แวร์ต่างๆ เพื่อใช้ในงานอุตสาหกรรมดิจิทัล นักออกแบบและพัฒนาสื่อมัลติมีเดียเชิงโต้ตอบ (Interactive Media Creator) ที่มีความเชี่ยวชาญในการสร้างสื่อมัลติมีเดียที่มีการโต้ตอบกับผู้ใช้ นักออกแบบและพัฒนาส่วนติดต่อผู้ใช้งานเชิงโต้ตอบ (Interactive User Interface Designer) ที่รับผิดชอบในการออกแบบส่วนติดต่อผู้ใช้งานที่มีการโต้ตอบ นักออกแบบประสบการณ์ผู้ใช้งาน (User Experience Designer) ที่มีความเชี่ยวชาญในการออกแบบประสบการณ์การใช้งานที่ดีตามความต้องการของผู้ใช้ และผู้ประกอบการที่ใช้เทคโนโลยีดิจิทัลเป็นฐาน (Digital Technology Startup) ที่มุ่งเน้นใช้เทคโนโลยีดิจิทัลในการพัฒนาธุรกิจและสร้างสรรค์นวัตกรรมใหม่ๆ ในอุตสาหกรรมดิจิทัล ค่ะ",

    "สาขา AAI": "หลังจากเรียนจบในคณะวิทยาการสารสนเทศ คุณสามารถเลือกทางอาชีพในสายงานด้านปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AII) ได้หลากหลาย รวมถึงการเป็นนักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) นักวิเคราะห์ข้อมูล (Data Analyst) วิศวกรวิเคราะห์ (Analytics Engineer) วิศวกรปัญญาประดิษฐ์ (AI Engineer) นักวิจัยที่เชี่ยวชาญในการออกแบบและพัฒนาระบบที่ใช้ปัญญาประดิษฐ์เป็นฐาน และการเป็นผู้ประกอบการในสตาร์ทอัพที่เน้นการประยุกต์ใช้ปัญญาประดิษฐ์ ค่ะ",
    "AAI": "หลังจากเรียนจบในคณะวิทยาการสารสนเทศ คุณสามารถเลือกทางอาชีพในสายงานด้านปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AII) ได้หลากหลาย รวมถึงการเป็นนักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) นักวิเคราะห์ข้อมูล (Data Analyst) วิศวกรวิเคราะห์ (Analytics Engineer) วิศวกรปัญญาประดิษฐ์ (AI Engineer) นักวิจัยที่เชี่ยวชาญในการออกแบบและพัฒนาระบบที่ใช้ปัญญาประดิษฐ์เป็นฐาน และการเป็นผู้ประกอบการในสตาร์ทอัพที่เน้นการประยุกต์ใช้ปัญญาประดิษฐ์ ค่ะ",
    "AAI จบไปทำอะไรได้บ้าง": "หลังจากเรียนจบในคณะวิทยาการสารสนเทศ คุณสามารถเลือกทางอาชีพในสายงานด้านปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AII) ได้หลากหลาย รวมถึงการเป็นนักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) นักวิเคราะห์ข้อมูล (Data Analyst) วิศวกรวิเคราะห์ (Analytics Engineer) วิศวกรปัญญาประดิษฐ์ (AI Engineer) นักวิจัยที่เชี่ยวชาญในการออกแบบและพัฒนาระบบที่ใช้ปัญญาประดิษฐ์เป็นฐาน และการเป็นผู้ประกอบการในสตาร์ทอัพที่เน้นการประยุกต์ใช้ปัญญาประดิษฐ์ ค่ะ",
    "ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AAI)": "หลังจากเรียนจบในคณะวิทยาการสารสนเทศ คุณสามารถเลือกทางอาชีพในสายงานด้านปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AII) ได้หลากหลาย รวมถึงการเป็นนักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) นักวิเคราะห์ข้อมูล (Data Analyst) วิศวกรวิเคราะห์ (Analytics Engineer) วิศวกรปัญญาประดิษฐ์ (AI Engineer) นักวิจัยที่เชี่ยวชาญในการออกแบบและพัฒนาระบบที่ใช้ปัญญาประดิษฐ์เป็นฐาน และการเป็นผู้ประกอบการในสตาร์ทอัพที่เน้นการประยุกต์ใช้ปัญญาประดิษฐ์ ค่ะ",
    "ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ": "หลังจากเรียนจบในคณะวิทยาการสารสนเทศ คุณสามารถเลือกทางอาชีพในสายงานด้านปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AII) ได้หลากหลาย รวมถึงการเป็นนักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) นักวิเคราะห์ข้อมูล (Data Analyst) วิศวกรวิเคราะห์ (Analytics Engineer) วิศวกรปัญญาประดิษฐ์ (AI Engineer) นักวิจัยที่เชี่ยวชาญในการออกแบบและพัฒนาระบบที่ใช้ปัญญาประดิษฐ์เป็นฐาน และการเป็นผู้ประกอบการในสตาร์ทอัพที่เน้นการประยุกต์ใช้ปัญญาประดิษฐ์ ค่ะ",
    "เรียนจบทำอะไร": "หลังจากเรียนจบในคณะวิทยาการสารสนเทศ คุณสามารถเลือกทางอาชีพในสายงานด้านปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AII) ได้หลากหลาย รวมถึงการเป็นนักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) นักวิเคราะห์ข้อมูล (Data Analyst) วิศวกรวิเคราะห์ (Analytics Engineer) วิศวกรปัญญาประดิษฐ์ (AI Engineer) นักวิจัยที่เชี่ยวชาญในการออกแบบและพัฒนาระบบที่ใช้ปัญญาประดิษฐ์เป็นฐาน และการเป็นผู้ประกอบการในสตาร์ทอัพที่เน้นการประยุกต์ใช้ปัญญาประดิษฐ์ ค่ะ",
    "สายงาน AII": "หลังจากเรียนจบในคณะวิทยาการสารสนเทศ คุณสามารถเลือกทางอาชีพในสายงานด้านปัญญาประดิษฐ์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AII) ได้หลากหลาย รวมถึงการเป็นนักวิเคราะห์และออกแบบระบบงานสารสนเทศ (Information System Analyst) นักวิเคราะห์ข้อมูล (Data Analyst) วิศวกรวิเคราะห์ (Analytics Engineer) วิศวกรปัญญาประดิษฐ์ (AI Engineer) นักวิจัยที่เชี่ยวชาญในการออกแบบและพัฒนาระบบที่ใช้ปัญญาประดิษฐ์เป็นฐาน และการเป็นผู้ประกอบการในสตาร์ทอัพที่เน้นการประยุกต์ใช้ปัญญาประดิษฐ์ ค่ะ",

    "คณะวิทยาการสารสนเทศมีเรียนต่อมั้ย": "ในระดับปริญญาโททางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรวิทยาศาสตรมหาบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",
    "คณะมีเรียนต่อมั้ย": "ในระดับปริญญาโททางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรวิทยาศาสตรมหาบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",
    "เรียนต่อได้มั้ย": "ในระดับปริญญาโททางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรวิทยาศาสตรมหาบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",
    "ปริญญาโท": "ในระดับปริญญาโททางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรวิทยาศาสตรมหาบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",

    "คณะวิทยาการสารสนเทศ ": " ในระดับปริญญาเอกทางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรปรัชญาดุษฎีบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",
    "คณะ": " ในระดับปริญญาเอกทางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรปรัชญาดุษฎีบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",
    "เรียนต่อ": " ในระดับปริญญาเอกทางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรปรัชญาดุษฎีบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",
    "ปริญญาโท ": " ในระดับปริญญาเอกทางคณะวิทยาการสารสนเทศมหาวิทยาลัยบูรพามีการเปิดสอนหลักสูตรปรัชญาดุษฎีบัณฑิตสาขาวิชาวิทยาการข้อมูลค่ะ",

    "สาขา CS": "ในสาขา CS จะเป็นการเรียนเกี่ยวกับการศึกษาค้นคว้าทฤษฏี การคำนวณสำหรับคอมพิวเตอร์  และทฤษฏีการประมวลผลสารสนเทศ ทั้งด้านซอฟต์แวร์ ฮาร์ดแวร์และเครือข่าย เช่น การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี  ทฤษฎีภาษาโปรแกรม ทฤษฏีการพัฒนาซอฟต์แวร์ ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์ และทฤษฏีเครือข่าย ค่ะ",
    "CS": "ในสาขา CS จะเป็นการเรียนเกี่ยวกับการศึกษาค้นคว้าทฤษฏี การคำนวณสำหรับคอมพิวเตอร์  และทฤษฏีการประมวลผลสารสนเทศ ทั้งด้านซอฟต์แวร์ ฮาร์ดแวร์และเครือข่าย เช่น การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี  ทฤษฎีภาษาโปรแกรม ทฤษฏีการพัฒนาซอฟต์แวร์ ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์ และทฤษฏีเครือข่าย ค่ะ",
    " วิทยาการคอมพิวเตอร์ (Computer Science: CS)": "ในสาขา CS จะเป็นการเรียนเกี่ยวกับการศึกษาค้นคว้าทฤษฏี การคำนวณสำหรับคอมพิวเตอร์  และทฤษฏีการประมวลผลสารสนเทศ ทั้งด้านซอฟต์แวร์ ฮาร์ดแวร์และเครือข่าย เช่น การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี  ทฤษฎีภาษาโปรแกรม ทฤษฏีการพัฒนาซอฟต์แวร์ ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์ และทฤษฏีเครือข่าย ค่ะ",
    "สาขาวิทยาการคอมพิวเตอร์เป็นยังไง": "ในสาขา CS จะเป็นการเรียนเกี่ยวกับการศึกษาค้นคว้าทฤษฏี การคำนวณสำหรับคอมพิวเตอร์  และทฤษฏีการประมวลผลสารสนเทศ ทั้งด้านซอฟต์แวร์ ฮาร์ดแวร์และเครือข่าย เช่น การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี  ทฤษฎีภาษาโปรแกรม ทฤษฏีการพัฒนาซอฟต์แวร์ ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์ และทฤษฏีเครือข่าย ค่ะ",
    "เรียนวิทยาการคอมพิวเตอร์": "ในสาขา CS จะเป็นการเรียนเกี่ยวกับการศึกษาค้นคว้าทฤษฏี การคำนวณสำหรับคอมพิวเตอร์  และทฤษฏีการประมวลผลสารสนเทศ ทั้งด้านซอฟต์แวร์ ฮาร์ดแวร์และเครือข่าย เช่น การวิเคราะห์และสังเคราะห์ขั้นตอนวิธี  ทฤษฎีภาษาโปรแกรม ทฤษฏีการพัฒนาซอฟต์แวร์ ทฤษฎีฮาร์ดแวร์คอมพิวเตอร์ และทฤษฏีเครือข่าย ค่ะ",

    "สาขา SE": "จะเป็นการเรียนที่เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรม ในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมายภายใต้เงื่อนไขที่กำหนดโดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ กระบวนการพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ เป็นต้น ค่ะ",
    "SE": "จะเป็นการเรียนที่เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรม ในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมายภายใต้เงื่อนไขที่กำหนดโดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ กระบวนการพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ เป็นต้น ค่ะ",
    "สาขาวิศวกรรมซอฟต์แวร์เป็นยังไง": "จะเป็นการเรียนที่เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรม ในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมายภายใต้เงื่อนไขที่กำหนดโดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ กระบวนการพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ เป็นต้น ค่ะ",
    "สาขาวิศวกรรมซอฟต์แวร์": "จะเป็นการเรียนที่เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรม ในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมายภายใต้เงื่อนไขที่กำหนดโดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ กระบวนการพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ เป็นต้น ค่ะ",
    "เรียนวิศวกรรมซอฟต์แวร์": "จะเป็นการเรียนที่เกี่ยวข้องกับการใช้กระบวนการทางวิศวกรรม ในการดูแลการผลิตซอฟต์แวร์ที่สามารถปฏิบัติงานตามเป้าหมายภายใต้เงื่อนไขที่กำหนดโดยเริ่มตั้งแต่การเก็บความต้องการ การตั้งเป้าหมายของระบบ การออกแบบ กระบวนการพัฒนา การตรวจสอบ การประเมินผล การติดตามโครงการ การประเมินต้นทุน การรักษาความปลอดภัย ไปจนถึงการคิดราคาซอฟต์แวร์ เป็นต้น ค่ะ",

    "สาขา ITDI": "ในสาขา ITDI จะเป็นการเรียนที่เกี่ยวข้องกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ ซึ่งครอบคลุมถึงการรับ-ส่ง การแปลง การจัดเก็บ การประมวลผล และการค้นคืนสารสนเทศเป็นการประยุกต์ใช้ทฤษฎี และขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงานการศึกษาอุปกรณ์ต่าง ๆ ทางเทคโนโลยีสารสนเทศ การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม ค่ะ",
    "ITDI": "ในสาขา ITDI จะเป็นการเรียนที่เกี่ยวข้องกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ ซึ่งครอบคลุมถึงการรับ-ส่ง การแปลง การจัดเก็บ การประมวลผล และการค้นคืนสารสนเทศเป็นการประยุกต์ใช้ทฤษฎี และขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงานการศึกษาอุปกรณ์ต่าง ๆ ทางเทคโนโลยีสารสนเทศ การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม ค่ะ",
    "สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล(ITDI)": "ในสาขา ITDI จะเป็นการเรียนที่เกี่ยวข้องกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ ซึ่งครอบคลุมถึงการรับ-ส่ง การแปลง การจัดเก็บ การประมวลผล และการค้นคืนสารสนเทศเป็นการประยุกต์ใช้ทฤษฎี และขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงานการศึกษาอุปกรณ์ต่าง ๆ ทางเทคโนโลยีสารสนเทศ การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม ค่ะ",
    "สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล": "ในสาขา ITDI จะเป็นการเรียนที่เกี่ยวข้องกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ ซึ่งครอบคลุมถึงการรับ-ส่ง การแปลง การจัดเก็บ การประมวลผล และการค้นคืนสารสนเทศเป็นการประยุกต์ใช้ทฤษฎี และขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงานการศึกษาอุปกรณ์ต่าง ๆ ทางเทคโนโลยีสารสนเทศ การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม ค่ะ",
    "เรียนเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรมดิจิทัล": "ในสาขา ITDI จะเป็นการเรียนที่เกี่ยวข้องกับการประยุกต์ใช้เทคโนโลยีในการประมวลผลสารสนเทศ ซึ่งครอบคลุมถึงการรับ-ส่ง การแปลง การจัดเก็บ การประมวลผล และการค้นคืนสารสนเทศเป็นการประยุกต์ใช้ทฤษฎี และขั้นตอนวิธีจากวิทยาการคอมพิวเตอร์ในการทำงานการศึกษาอุปกรณ์ต่าง ๆ ทางเทคโนโลยีสารสนเทศ การวางโครงสร้างสถาปัตยกรรมองค์กรด้วยเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพสูงสุดกับสังคม ธุรกิจ องค์กร หรืออุตสาหกรรม ค่ะ",

    "สาขา AAIมีอะไรบ้าง": "ในสาขา AAI จะเป็นการเรียนที่เกี่ยวข้องกับปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล และระบบอัจฉริยะ เช่น โรงงานอัจฉริยะ (Smart Factory) เกษตรอัจฉริยะ (Smart Agriculture) ฟาร์มอัจฉริยะ (Smart Farming) และ เมืองอัจฉริยะ (Smart City) ค่ะ",
    "AAIเรียนอะไรบ้าง": "ในสาขา AAI จะเป็นการเรียนที่เกี่ยวข้องกับปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล และระบบอัจฉริยะ เช่น โรงงานอัจฉริยะ (Smart Factory) เกษตรอัจฉริยะ (Smart Agriculture) ฟาร์มอัจฉริยะ (Smart Farming) และ เมืองอัจฉริยะ (Smart City) ค่ะ",
    "ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ (Applied Artificial Intelligence and Smart Technology: AAI)": "ในสาขา AAI จะเป็นการเรียนที่เกี่ยวข้องกับปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล และระบบอัจฉริยะ เช่น โรงงานอัจฉริยะ (Smart Factory) เกษตรอัจฉริยะ (Smart Agriculture) ฟาร์มอัจฉริยะ (Smart Farming) และ เมืองอัจฉริยะ (Smart City) ค่ะ",
    "ปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะ": "ในสาขา AAI จะเป็นการเรียนที่เกี่ยวข้องกับปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล และระบบอัจฉริยะ เช่น โรงงานอัจฉริยะ (Smart Factory) เกษตรอัจฉริยะ (Smart Agriculture) ฟาร์มอัจฉริยะ (Smart Farming) และ เมืองอัจฉริยะ (Smart City) ค่ะ",
    "เรียนAAI AI เรียนยังไง": "ในสาขา AAI จะเป็นการเรียนที่เกี่ยวข้องกับปัญญาประดิษฐ์ประยุกต์และเทคโนโลยีอัจฉริยะได้พัฒนาขึ้นเพื่อตอบสนองต่อความต้องการบุคลากรด้านเทคโนโลยีสารสนเทศเพื่อการเปลี่ยนรูปองค์การไปสู่องค์กรอัจฉริยะที่ขับเคลื่อนด้วยข้อมูล (Data-driven Business) บนพื้นฐานของเทคโนโลยีปัญญาประดิษฐ์ตลอดถึงการพัฒนากำลังคนในธุรกิจดิจิทัล และระบบอัจฉริยะ เช่น โรงงานอัจฉริยะ (Smart Factory) เกษตรอัจฉริยะ (Smart Agriculture) ฟาร์มอัจฉริยะ (Smart Farming) และ เมืองอัจฉริยะ (Smart City) ค่ะ",

}


con = ' '.join(''.join(value) if isinstance(value, list)
               else value for value in rule_based_responses.values())

line_bot_api = LineBotApi(
    'W8wWPV62rWD9TEBEzZ0l3ZLVKXR3JZ5XhVMGMekvgG+9J2OgGxDQCBTj1ok/raQm44+BdgrL/vMjC193Mx4Qn8qfVpe98av9c3rFtRQ5vpiQ5XRIxfYyamR9FyC9EUz1XSOgGXRHQK6DbKkQWtONWAdB04t89/1O/w1cDnyilFU=')
handler = WebhookHandler('9807cfec5558c0338f2853f050eb1667')


@app.get("/")  # Handles GET requests for verification
async def verify_line_webhook(request: Request):
    print(request)
    # LINE sends a verification challenge as a query parameter
    challenge = request.query_params.get("hub.challenge")
    if challenge:
        # Echo the challenge back in the response
        return JSONResponse(content={"challenge": challenge}, status_code=200)
    else:
        # No challenge found, return an appropriate response
        return JSONResponse(content={"message": "Challenge not found"}, status_code=400)


@app.post("/")  # Your actual webhook handling POST requests
async def handle_webhook(request: Request):
    # Your webhook handling logic here
    return JSONResponse(content={"message": "Webhook received"}, status_code=200)


@app.post("/webhook")
async def line_webhook(request: Request):
    # Get request body as text
    body = await request.body()
    body_text = body.decode("utf-8")

    # Get X-Line-Signature header value
    signature = request.headers["X-Line-Signature"]

    # Handle the webhook body
    try:
        handler.handle(body_text, signature)
    except InvalidSignatureError:
        return {"error": "Invalid signature."}
    except LineBotApiError as e:
        return {"error": str(e)}
    return "OK"

# Define how to handle text messages


@handler.add(MessageEvent, message=TextMessage)
def handle_text_message(event):
    user_message = event.message.text

    # Here, call your chatbot logic and get the response
    response = predefined_answer(user_message)  # This is your chatbot function

    # Respond to the user
    line_bot_api.reply_message(
        event.reply_token,
        TextSendMessage(text=response)
    )


sentences = [example for intent_data in dataset.values()
             for example in intent_data["examples"]]
labels = [intent for intent, intent_data in dataset.items()
          for _ in intent_data["examples"]]

for intent, intent_data in dataset.items():
    for example in intent_data["examples"]:
        sentences.append(example)
        labels.append(intent)

# Creating TF-IDF model
vectorizer = TfidfVectorizer()
X = vectorizer.fit_transform(sentences)


def chatbot_response(text):
    # Vectorize the input text
    text_vector = vectorizer.transform([text])
    # Calculate similarities with the dataset
    similarities = cosine_similarity(text_vector, X)
    max_similarity = np.max(similarities)

    # Define a threshold for determining a match (you may need to adjust this value)
    similarity_threshold = 0.1  # Example threshold

    if max_similarity < similarity_threshold:
        # If similarity is below threshold, return "I don't understand"
        return "ขออภัยค่ะ ฉันไม่เข้าใจคำถามของคุณ กรุณาถามคำถามใหม่อีกครั้งค่ะ"

    # If above threshold, find the closest matching intent
    closest = np.argmax(similarities, axis=1)[0]
    intent = labels[closest]
    response = random.choice(dataset[intent]["responses"])
    return response


def preprocess_text(text, lang='th'):
    if lang != 'th':
        raise ValueError(
            "This function currently only supports Thai language.")
    words = word_tokenize(text, keep_whitespace=False)
    corrected_words = [spell_checker.correct(word) for word in words]
    return ' '.join(corrected_words)


def generate_answer(question):
    response = mrcpipeline(question=question, context=con)
    return response['answer']


# Example usage
def predefined_answer(question):
    tokens_newmm = word_tokenize(question)
    user_input = ' '.join(tokens_newmm)
    response = chatbot_response(user_input)
    if response:  # Checks if `response` is not None or an empty string
        return response
    else:
        return None  # Returns None if no satisfactory answer can be generated


def clean_response(response_text):
    cleaned_text = response_text.replace("<extra_id_0>", "")
    return cleaned_text


if __name__ == '__main__':
    import uvicorn
    uvicorn.run(app, host="0.0.0.0", port=8000)
